{
  "navbar": {
    "media": "/assets/3d-headshot-lg.png",
    "heading": "Rohan Shrestha",
    "email": "[therohanshrestha6655@gmail.com](mailto:therohanshrestha6655@gmail.com)",
    "button": {
      "link": "/contact",
      "text": "Contact"
    },
    "profiles": [
      {
        "link": "[https://github.com/ROHAN-88](https://github.com/ROHAN-88)",
        "icon": "iconoir-github"
      },
      {
        "link": "[https://www.linkedin.com/in/rohan-shrestha23](https://www.linkedin.com/in/rohan-shrestha23)",
        "icon": "iconoir-linkedin"
      }
    ]
  },
  "bio": {
    "heading": "Who is Rohan Shrestha?",
    "description": [
      "I am a Full Stack Software Developer with hands-on experience building scalable, production-ready web applications using modern technologies such as React, Next.js, Node.js, and Python (Django/Flask).",
      "Since starting my journey in web development, I have delivered multiple real-world projects ranging from company websites to data-driven platforms, focusing on clean design, performance, and user-friendly experiences.",
      "Beyond professional work, I actively explore backend systems, automation tools like n8n, networking fundamentals, and machine learning basics, including building simple neural networks and maintaining a personal home lab for experimentation."
    ]
  },
  "experience": {
    "heading": "Experience",
    "experience": [
      {
        "date": "2023 – Present",
        "title": "Junior Software Developer",
        "company": "Monal Tech, Kathmandu",
        "description": "Working as a full stack developer building and maintaining web applications using React, Next.js, Node.js, Django, and Flask. Collaborating in Agile teams, integrating REST APIs, deploying applications with Docker and cloud platforms, and ensuring performance, security, and maintainability."
      },
      {
        "date": "2024 – Present",
        "title": "Freelance Full Stack Developer",
        "company": "Self-Employed / Freelance",
        "description": "Delivered end-to-end freelance projects including UI/UX design, frontend development, backend implementation, and deployment. Built full-stack company websites and product platforms like Street to Home using Next.js and Python (Django). Managed client communication, requirements, and production-ready deliveries."
      },
      {
        "date": "2023 - 2024",
        "title": "Executive Member",
        "company": "Nagarjuna ICT Club",
        "description": "Contributed to decision-making, project planning, and leadership activities. Supported peers in adopting tools and improving collaboration within technical and academic initiatives."
      }
    ]
  },
  "education": {
    "heading": "Education",
    "education": [
      {
        "date": "Degree",
        "degree": "Bachelor in Business Information Management (BIM)",
        "university": "Nagarjuna College of Information Technology, Tribhuvan University",
        "description": "Focused on software development, databases, systems analysis, and IT management."
      },
      {
        "date": "Professional Certificate",
        "degree": "MERN Stack Development",
        "university": "Broadway Infosys"
      },
      {
        "date": "Professional Certificate",
        "degree": "Web Design",
        "university": "Broadway Infosys"
      }
    ]
  },
  "capabilities": {
    "heading": "Capabilities",
    "capabilities": [
      {
        "name": "Figma",
        "description": "Built design systems and application prototypes."
      },
      {
        "name": "React & Next.js",
        "description": "Built responsive, component-based web applications with focus on performance and usability."
      },
      {
        "name": "JavaScript / TypeScript",
        "description": "Developed frontend and backend logic using modern JavaScript and TypeScript practices."
      },
      {
        "name": "MERN Stack",
        "description": "Built backend APIs (MongoDB) and connected them with frontend applications (React)."
      },
      {
        "name": "Git & GitHub",
        "description": "Used version control for collaborative development, code reviews, and CI/CD workflows."
      },
      {
        "name": "Python (Django & Flask)",
        "description": "Developed backend services, APIs, and server-side logic for full-stack applications."
      },
      {
        "name": "n8n",
        "description": "Built automated workflows, API integrations, and custom nodes to streamline application processes."
      }
    ]
  },
  "expertise": {
    "heading": "Expertise with Technologies",
    "expertise": [
      {
        "name": "Node.js & Express",
        "description": "Built RESTful APIs and backend services with focus on scalability and clean architecture."
      },
      {
        "name": "React (Vite / Next.js)",
        "description": "Developed modern frontend applications including company websites and product platforms."
      },
      {
        "name": "Tailwind CSS / Bootstrap",
        "description": "Created responsive and consistent UI designs using utility-first and component-based styling."
      },
      {
        "name": "Docker & Deployment",
        "description": "Deployed applications using Docker and cloud platforms such as Vercel and Heroku."
      },
      {
        "name": "n8n Workflow Automation",
        "description": "Implemented automation workflows integrating APIs, backend services, and AI-assisted processes."
      },
      {
        "name": "System & Networking Basics",
        "description": "Built a personal home lab using an old laptop as a server and learned foundational networking concepts."
      }
    ]
  }
}
